Tekla Open API Reference for Tekla Structures 2025
ClipPlane Class
 The ClipPlane class defines a clip plane which can be used together with a visible view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.UI.ClipPlane
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ClipPlane
<SerializableAttribute>
Public Class ClipPlane
The ClipPlane type exposes the following members.
Constructors
Name | Description
ClipPlane
Initializes a new instance of the ClipPlane class.
Top
Properties
Name | Description
ClipPlaneID
 Gets the clip plane ID.
IsBorderVisible
Gets or sets a value indicating whether the clip plane border is visible.
IsScissorVisible
Gets or sets a value indicating whether the clip plane scissor icon is visible.
Location
The clip plane location in global coordinates (XYZ).
UpVector
The clip plane up vector in global coordinates (XYZ).
View
The view the clip plane belongs to.
Top
Methods
Name | Description
Delete
 Deletes the clip plane from the application view. The application view must be visible.
Insert
 Creates a new clip plane to the application view. The application view must be visible.
Modify
 Modifies the clip plane position in the application view. The application view must be visible.
Top
Examples
 The following example shows how three ClipPlanes are created to the first visible view:
using System;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class ClipPlaneExample
{
    public void ClipPlaneExample1()
    {
        ModelViewEnumerator ViewEnum = ViewHandler.GetVisibleViews();
        ViewEnum.MoveNext();
        View ActiveView = ViewEnum.Current;
        ClipPlane CPlane = new ClipPlane();
        CPlane.View = ActiveView;
        CPlane.UpVector = new Vector(1, 0, 0);
        CPlane.Location = new Point(20000, 10000, 5000);
        CPlane.Insert();
        CPlane.UpVector = new Vector(0, 1, 0);
        CPlane.Location = new Point(10000, 20000, 2000);
        CPlane.Insert();
        CPlane.UpVector = new Vector(0, 0, 1);
        CPlane.Location = new Point(20000, 20000, 6000);
        CPlane.Insert();
    }
}
See Also
Reference
Tekla.Structures.Model.UI Namespace